'''
word tamp
{
    "word": "啊",
    "oldword": "啊",
    "strokes": "10",
    "pinyin": "ā",
    "radicals": "口",
    "explanation": "啊 \n\n (形声。从口,阿声。本义叹词) 表示惊叹或赞颂。如啊!多么美丽的夜色;啊!祖国,为您歌唱\n\n 啊á叹词。在句首，〈表〉疑问或反问～，这是什么？～，你想干什么？\n\n 啊ǎ叹词。在句首〈表〉疑惑～，这东西质量可靠吗？\n\n 啊ɑ助词。\n\n ①在句尾，〈表〉惊奇、赞叹等语气，常因前面字音的同，而有各种变音。也可用别的字来表示快来～（呀）！你们好～（哇）！大家加油干～（哪）！\n\n ②用于列事项之后米～、菜～、肉～，丰富极了。\n\n 啊à叹词。〈表〉应允、领悟或惊叹～，好吧，照你说的办！～，道了！～，大鱼上钩了！\n\n 啊ā叹词。在句首，〈表〉赞叹或惊奇～，太好了！～，太阳出来了！\n\n 啊a 1助词。用在句末表示感叹的语气。 2.助词。用在句末表示肯定﹑辩解﹑催促﹑嘱咐等语气。 3.助词。用在句末表示问的语气。 4.助词。用在句中表示停顿。\n\n 5.助词。用在列举的事项之后。",
    "more": "啊 a 部首 口 部首笔画 03 总笔画 10  啊\nah；eh；oh；o；\n啊1\nā\n(形声。从口,阿声。本义词) 表示惊叹或赞颂 [ah]。如啊!多么美丽的夜色;啊!祖国,我为您歌唱\n另见á；ǎ；à；ɑ\n啊哈\nāhā\n(1)\[oh;ah;well] 表示语气的叹词\n(2)\n表示惊喜\n啊哈,我看见他了\n(3)\n表示恍然大悟\n啊哈,我明白了\n(4\n表示满意\n啊哈,总算干得还不赖\n啊呀\nāyā\n(1)\n叹词\n(2)\n[oh]∶表示惊讶\n啊呀,他跑得真快呀\n(3\n[why]∶表示不满,为难\n啊呀,怎么弄了满地的水\n啊呀,这事不好办哪\n啊哟\nāyō\n[ayo] 叹词,表示情绪激或惊讶\n啊哟,吓死我了\n啊唷\nāyō\n同啊哟”\n啊2\ná\n〈叹〉\n表示追问或要求再说一遍 [ah]。如啊?你谁?你想过这些事没有?啊!\n另见ā；ǎ；à；ɑ\n啊3\nǎ\n〈叹〉\n表示惊疑或疑惑 [ah]。如啊?这是怎么回事;说我还小,啊?我不小了吧;啊?可以这样说吗?\n另见ā；á；à；ɑ\n啊4\nà\n〈叹〉\n(1)\n表示应诺等的叹词 [ah\n(2)\n表示应诺。如啊,我就去;啊,好吧\n(3)\n表示醒悟。如啊,对啦!对啦;啊,原来是他,怪不得看着挺面熟\(4)\n表示惊异或赞叹。如啊!黄河,你是我们民族的摇篮\n(5)\n用来表示悲痛、遗憾或忧伤 [woe]\n另见ā；áǎ；ɑ\n啊5\n(1)\n阿\nɑ\n(2)\n表示语气 [what]\n(3)\n用在感叹句末,加强感叹语气。如他跑得真快啊\n(4\n用在陈述句或祈使句,表示肯定、辨明、请求、劝止、警告、催促、命令等。如这话说得对啊!请坐啊,女士们\(5)\n用在问句末尾 [really?]\n(6)\n在有疑问指代词的问句或选择问句里,用来和缓语气。如是谁啊?\n(7)\n陈述句形式的问句里,提问的目的是要求得到证实。如你不去啊?\n(8)\n用在打招呼的话里 [hay]。如老张啊,你儿来!\n(9)\n用在重复的动词后面,表示过程长 [on and on]。如…找啊找啊,终于找到了金矿\n另见ā；á；ǎ；à\n阿”另见ā；ǎ；à；ē\n啊1\nā　ㄚˉ\n叹词，表示赞叹或惊异～，这花真美呀！～哈。～呀。\n郑码jyaju554a，gbkb0a1\n笔画数10，部首口，笔顺编号2515212512\nah；eh；oh；o；\n啊2\ná　ㄚˊ\n叹词，表示问或反问～，你说什么？\n郑码jyaj，u554a，gbkb0a1\n笔画数10，部首口，笔顺编号2515212512\nah；ehoh；o；\n啊3\nǎ　ㄚˇ\n叹词，表示疑惑～，这是怎么回事？\n郑码jyaj，u554a，gbkb0a1\n笔画数10，部口，笔顺编号2515212512\nah；eh；oh；o；\n啊4\nà　ㄚ╝\n(1)\n叹词，表示应诺（音较短）～，好吧！\n(2\n叹词，表示醒悟（音较长）～，我这才明白过来！\n(3)\n表示赞叹（音较长）～，亲爱的祖国！\n郑码jyaju554a，gbkb0a1\n笔画数10，部首口，笔顺编号2515212512\nah；eh；oh；o；\n啊5\nɑ　ㄚ\n助词，在句末表示惊叹的语气（常因前面字音不同而发生变音，可用不同的字来表示）你好～（哇）！真新鲜～（哪）！\n郑jyaj，u554a，gbkb0a1\n笔画数10，部首口，笔顺编号2515212512"
},


ci tamp

{"ci": "宸纶", "explanation": "1.帝王的诏书﹑制令。"}

idiom tamp 
{"derivation": "语出《法华经·法师功德品》下至阿鼻地狱。”", "example": "但也有少数意志薄弱的……逐步上当，终至堕入～。★《上饶集中营·炼狱杂记》", "explanation": "阿鼻梵语的译音，意译为无间”，即痛苦无有间断之意。常用来比喻黑暗的社会和严酷的牢狱。又比喻无法摆脱的极其痛苦的境地。", "pinyin": "ā bí dì yù", "word": "阿鼻地狱", "abbreviation": "abdy"}

xiehouyu tamp
{
    "riddle": "做砖的坯子、插刀的鞘子",
    "answer": "框框套套"
},
'''